Revit 2024 API
SystemZoneData.Create Method
 Creates a new instance of a system-zone data domain class.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public static SystemZoneData Create()
Visual Basic
Public Shared Function Create As SystemZoneData
Visual C++
public:
static SystemZoneData^ Create()
Return Value
 The newly created data domain instance.
See Also
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace